## groupby extras

In [1]:
import pandas as pd
import numpy as np

stock = pd.DataFrame({
    'item_no': pd.Series([1, 2, 2, 4, 5, 6, 7, 8, 9, 10], dtype='Int64'),
    'cost_class': pd.Series(['1st', '2nd', '3rd', '4th', '4th', '3rd', '2nd', np.nan, '1st', '3rd'], dtype='string'),
    'cost': pd.Series([10.99, np.nan, 2.99, np.nan, 2.99, 2.45, 5.99, 5.99, 3.00, None], dtype='float64'),
    'stock_code': pd.Series(['a', 'a', 'c', 'b', 'a', 'b', np.nan, np.nan, 'a', 'c'], dtype='string'),
    'priority_code': pd.Series([np.nan, None, 'a', 'b', None, 'a', 'e', None, 'a', 'd'], dtype='string'),
    'tax_rate': pd.Series([0, 0, 20, 20, 20, 0, 20, 20, 5, 20])
})

stock

   item_no cost_class   cost stock_code priority_code  tax_rate
0        1        1st  10.99          a          <NA>         0
1        2        2nd    NaN          a          <NA>         0
2        2        3rd   2.99          c             a        20
3        4        4th    NaN          b             b        20
4        5        4th   2.99          a          <NA>        20
5        6        3rd   2.45          b             a         0
6        7        2nd   5.99       <NA>             e        20
7        8       <NA>   5.99       <NA>          <NA>        20
8        9        1st   3.00          a             a         5
9       10        3rd    NaN          c             d        20

In [3]:
grouped_stock = stock.groupby('stock_code')

In [5]:
grouped_stock.cost_class.min()

stock_code
a    1st
b    3rd
c    3rd
Name: cost_class, dtype: string

In [8]:
pd.DataFrame(grouped_stock).loc[0, 1]

   item_no cost_class   cost stock_code priority_code  tax_rate
0        1        1st  10.99          a          <NA>         0
1        2        2nd    NaN          a          <NA>         0
4        5        4th   2.99          a          <NA>        20
8        9        1st   3.00          a             a         5

In [10]:
grouped_stock.count()

            item_no  cost_class  cost  priority_code  tax_rate
stock_code
a                 4           4     3              1         4
b                 2           2     1              2         2
c                 2           2     1              2         2

## apply multiple aggregators to a group

In [13]:
multiple_aggregators = grouped_stock.agg(['count', 'min', 'max'])

In [15]:
# columns are now a multiindex
multiple_aggregators.columns

MultiIndex([(      'item_no', 'count'),
            (      'item_no',   'min'),
            (      'item_no',   'max'),
            (   'cost_class', 'count'),
            (   'cost_class',   'min'),
            (   'cost_class',   'max'),
            (         'cost', 'count'),
            (         'cost',   'min'),
            (         'cost',   'max'),
            ('priority_code', 'count'),
            ('priority_code',   'min'),
            ('priority_code',   'max'),
            (     'tax_rate', 'count'),
            (     'tax_rate',   'min'),
            (     'tax_rate',   'max')],
           )

In [16]:
#max cost for each stock code 
multiple_aggregators.loc[:, ('cost', 'max')]

stock_code
a    10.99
b     2.45
c     2.99
Name: (cost, max), dtype: float64

In [18]:
#task: mean, count and max for all columns

grouped_stock.agg(['count', 'mean', 'max'])

/var/folders/vq/49_dlfvs3h5cps28stxlbm2m0000gn/T/ipykernel_89314/3810964269.py:3: FutureWarning: ['cost_class', 'priority_code'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped_stock.agg(['count', 'mean', 'max'])

           item_no            cost              tax_rate
             count  mean max count  mean    max    count   mean max
stock_code
a                4  4.25   9     3  5.66  10.99        4   6.25  20
b                2   5.0   6     1  2.45   2.45        2  10.00  20
c                2   6.0  10     1  2.99   2.99        2  20.00  20

In [20]:
#specify which operations for which columns 
grouped_stock.agg({
    'cost_class': ['count', 'min', 'max'],
    'cost': ['mean', 'median'],
    'stock_code': ['count']
})

           cost_class            cost        stock_code
                count  min  max  mean median      count
stock_code
a                   4  1st  4th  5.66   3.00          4
b                   2  3rd  4th  2.45   2.45          2
c                   2  3rd  3rd  2.99   2.99          2

In [27]:
##task group by cost class and stcok code, calc mean for numerics

cc_sc_mean = stock.groupby(['cost_class', 'stock_code']).agg({
    'cost': ['mean'],
    'tax_rate': ['mean']
})

In [28]:
#extract mean cost for items in 3rd cost class with stock code 'c'
cc_sc_mean.loc[('3rd', 'c'), 'cost']

mean    2.99
Name: (3rd, c), dtype: float64

## custom aggregators

In [29]:
#sum of each stock code group plus a 2 pound stocking fee per item
stock_costs = grouped_stock.agg({
    'item_no': ['count'],
    'cost': ['sum']
})

In [32]:
stock_costs[('cost', 'sum')] = stock_costs['cost', 'sum'] - 2*stock_costs[('item_no', 'count')]

In [33]:
stock_costs

           item_no  cost
             count   sum
stock_code
a                4  8.98
b                2 -1.55
c                2 -1.01

In [38]:
#define our own function
def sum_minus_restocking(rows, restocking_fee=2.00):
    return(rows.sum() - (rows.count() * restocking_fee))

In [39]:
stock_costs = grouped_stock.agg({
    'item_no': ['count'],
    'cost': sum_minus_restocking
})

In [40]:
#different result due to handling of na values
stock_costs

           item_no                 cost
             count sum_minus_restocking
stock_code
a                4                10.98
b                2                 0.45
c                2                 0.99